In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [19]:
import warnings
warnings.filterwarnings("ignore")

In [20]:
dataset=pd.read_csv("Social_Network_Ads.csv")

In [21]:
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [22]:
dataset.columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

In [23]:
dataset=pd.get_dummies(dataset, dtype=int, drop_first=True)

In [24]:
dataset

      User ID  Age  EstimatedSalary  Purchased  Gender_Male
0    15624510   19            19000          0            1
1    15810944   35            20000          0            1
2    15668575   26            43000          0            0
3    15603246   27            57000          0            0
4    15804002   19            76000          0            1
..        ...  ...              ...        ...          ...
395  15691863   46            41000          1            0
396  15706071   51            23000          1            1
397  15654296   50            20000          1            0
398  15755018   36            33000          0            1
399  15594041   49            36000          1            0

[400 rows x 5 columns]

In [25]:
dataset.columns

Index(['User ID', 'Age', 'EstimatedSalary', 'Purchased', 'Gender_Male'], dtype='object')

In [26]:
independent=dataset[['User ID', 'Age', 'EstimatedSalary', 'Gender_Male']]

In [27]:
dependent=dataset[['Purchased']]

In [28]:
independent.shape

(400, 4)

In [29]:
dependent

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

In [30]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test=train_test_split(independent, dependent,test_size=1/3, random_state=0)

In [31]:
from sklearn.svm import SVC
classifier=SVC(kernel='rbf', random_state=0)
classifier=classifier.fit(X_train,y_train)

In [32]:
y_predict=classifier.predict(X_test)

In [34]:
from sklearn.metrics import confusion_matrix
cm=confusion_matrix(y_test, y_predict)

In [35]:
from sklearn.metrics import classification_report
cl_report=classification_report(y_test,y_predict)

In [37]:
print(cl_report)

              precision    recall  f1-score   support

           0       0.63      1.00      0.78        85
           1       0.00      0.00      0.00        49

    accuracy                           0.63       134
   macro avg       0.32      0.50      0.39       134
weighted avg       0.40      0.63      0.49       134

In [38]:
print(cm)

[[85  0]
 [49  0]]